app/controllers/topics_controller.rb

  def index
    @topics = Topic.all
---
SELECT `topics`.* FROM `topics`

  def create
    @topic = Topic.new(topic_params)

    respond_to do |format|
      if @topic.save
---
INSERT INTO `topics` (`name`, `user_id`, `created_at`, `updated_at`) VALUES ('Swach Bharath', 1, '2015-04-15 09:34:22', '2015-04-15 09:34:22')

    def set_topic
      @topic = Topic.find(params[:id])
---
SELECT  `topics`.* FROM `topics` WHERE `topics`.`id` = 1 LIMIT 1